app/views/cart/createOrder.html.erb

SELECT  "orders".* FROM "orders" ORDER BY "orders"."id" DESC LIMIT ?  [["LIMIT", 1]]
---
    <tr>
        <% @orders.limit(1).order(id: :desc).each do |order| %>

SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT  "orderitems".* FROM "orderitems" WHERE "orderitems"."id" = 21 LIMIT ?  [["LIMIT", 1]]
---
<tr>
    <% item = Orderitem.find_by_id(id) %>