app/controllers/cart_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "orders".* FROM "orders" ORDER BY "orders"."id" DESC LIMIT ?  [["LIMIT", 1]]
INSERT INTO "orders" ("order_date", "user_id", "status", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["order_date", "2018-04-07 15:38:16.921346"], ["user_id", 1], ["status", "Pending"], ["created_at", "2018-04-07 15:38:16.938668"], ["updated_at", "2018-04-07 15:38:16.938668"]]
SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT  "orderitems".* FROM "orderitems" WHERE "orderitems"."id" = 21 LIMIT ?  [["LIMIT", 1]]
INSERT INTO "orderitems" ("item_id", "title", "description", "quantity", "price", "order_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def createOrder

    # Step 1 : Get id of current user
    @user = User.find(current_user.id)

    # step 2: Create an order for the current user

    @order = @user.orders.build(:order_date => DateTime.now, :status => 'Pending')

    @order.save


    # Step 3: Create order with the current cart items

    @cart = session[:cart] || {} # Getting the content of the current cart

    @cart.each do | id, quantity |
      item = Item.find_by_id(id)

      @orderitem = @order.orderitems.build(:item_id => item.id, :title => item.title, :description => item.description, :quantity => quantity, :price => item.price)

    @orderitem.save