app/controllers/items_controller.rb

  def create
    @item = Item.new(item_params)

    respond_to do |format|
      if @item.save
---
INSERT INTO "items" ("title", "description", "price", "image_url", "category", "brand", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @item.update(item_params)
---
UPDATE "items" SET "category" = ?, "updated_at" = ? WHERE "items"."id" = ?  [["category", "Irons"], ["updated_at", "2018-04-06 20:46:38.474724"], ["id", 3]]

  def search
    st = "%#{params[:q]}%"
    @items = Item.where("title like ?", st)
---
SELECT "items".* FROM "items" WHERE (title like '%woods')