app/controllers/orders_controller.rb

  def index
    #for limiting orders listed only for who is logged in uncomment below and comment @orders = Order.all
    #@user = User.find(current_user.id)

    #@orders = @user.orders.all
    @orders = Order.all
---
SELECT "orders".* FROM "orders"

  def show

    @orderitems = Orderitem.where(order_id: params[:id])
---
SELECT "orderitems".* FROM "orderitems" WHERE "orderitems"."order_id" = ?  [["order_id", 2]]