app/controllers/static_pages_controller.rb

  def home
    @categories = Category.all
---
SELECT "categories".* FROM "categories"

  def category
    catName = params[:title]

    @items = Item.where("category like ?", catName)
---
SELECT "items".* FROM "items" WHERE (category like 'Irons')

  def paid
    flash[:notice] = 'Transaction Complete'

    @order = Order.last

    @order.update_attribute(:status, "Paid by User: #{current_user.email} ")
---
SELECT  "orders".* FROM "orders" ORDER BY "orders"."id" DESC LIMIT ?  [["LIMIT", 1]]
UPDATE "orders" SET "status" = ?, "updated_at" = ? WHERE "orders"."id" = ?  [["status", "Paid by User: test@gmail.com "], ["updated_at", "2018-04-13 19:25:31.163200"], ["id", 21]]